УТ/src/InformationRegisters/НастройкиУчетаНДСПриУСНКомитентов/НастройкиУчетаНДСПриУСНКомитентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаНДСПриУСНКомитентов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ОсновноеНалогообложение</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </resources>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18/118</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10/110</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20/120</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Ставка НДС 5%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
    <comment>Расчетная ставка НДС 5/105</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Ставка НДС 7%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
    <comment>Расчетная ставка НДС 7/107</comment>
  </enumValues>
  <enumValues>
    <name>НДС22_122</name>
    <comment>Расчетная ставка НДС 22/122</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтавкиНДС</name>
  <comment>Ставки НДС</comment>
  <predefined>
    <items>
      <name>БезНДС</name>
    </items>
  </predefined>
  <attributes>
    <name>ПеречислениеСтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСтавка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствующаяБазоваяСтавка</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствующаяРасчетнаяСтавка</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыНалогообложенияНДС</name>
    <attributes>
      <name>ТипНалогообложенияНДС</name>
      <type>
        <types>EnumRef.ТипыНалогообложенияНДС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/InformationRegisters/НастройкиУчетаНДСПриУСНКомитентов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяРегистра = Метаданные.РегистрыСведений.НастройкиУчетаНДСПриУСНКомитентов.Имя;
	
	ТолькоПросмотр = НЕ УправлениеДоступом.ИзменениеРазрешено(РегистрыСведений.НастройкиУчетаНДСПриУСНКомитентов);
	Элементы.ГруппаНалогообложениеИСтавкиНДС.ТолькоПросмотр = ТолькоПросмотр;
	
	КлючЗаписи = Неопределено;
	ЭтоФормаЗаписи = НЕ Параметры.Свойство("Ключ", КлючЗаписи);
	
	Параметры.Свойство("Комитент", Комитент);
	Элементы.Комитент.Видимость = НЕ ЗначениеЗаполнено(Комитент);
	
	Если ЗначениеЗаполнено(Комитент) Тогда
		Заголовок = Заголовок + ": " + Строка(Комитент);
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СкопироватьЗаписьРегистра(Параметры.ЗначениеКопирования);
	Иначе
		ПрочитатьЗаписьРегистра(КлючЗаписи);
	КонецЕсли;
	
	ДатаПредыдущая = ДатаИзменения;
	УчетНДСРФ.ОписаниеЛимитовПримененияСтавокНДС(Элементы, ДатаИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаИзмененияПриИзменении(Элемент)
	
	ДатаИзменения = НачалоМесяца(ДатаИзменения);
	ТекстВопроса  = НСтр("ru = 'Создать новую настройку на %1?'");
	ТекстВопроса  = СтрШаблон(ТекстВопроса, Формат(ДатаИзменения,"ДЛФ=D"));
	ПоказатьВопрос(Новый ОписаниеОповещения("ДатаИзмененияПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура КомитентПриИзменении(Элемент)
	
	Комитент = Запись.Комитент;
	ПрочитатьЗаписьРегистраПриИзменииРеквизита(, ДатаИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеИсторииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИсторияИзменений" Тогда
		Если Модифицированность Тогда
			ЗадатьВопросФормаМодифицирована("ОткрытьИсториюИзмененийПродолжение");
		Иначе
			ОткрытьИсториюИзменений();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЗаписатьИзменения(Истина) Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьИзменения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ЗадатьВопросФормаМодифицирована(ИмяОповещения)
	
	ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
	Оповещение = Новый ОписаниеОповещения(ИмяОповещения, ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзмененияПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт  
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ПрочитатьЗаписьРегистраПриИзменииРеквизита(, ДатаИзменения);
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		ПрочитатьЗаписьРегистраПриИзменииРеквизита(, ДатаИзменения, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьЗаписьРегистра(ЗначениеКопирования)
	
	НастройкиНалоговУчетныхПолитик.СкопироватьУчетнуюПолитику(ЭтотОбъект, ЗначениеКопирования, ИмяРегистра, "Комитент");
	Копирование = Истина;
	Модифицированность = Истина;
		
КонецПроцедуры 

&НаСервере
Процедура ПрочитатьЗаписьРегистра(КлючЗаписи = Неопределено, ПериодЗаписи = Неопределено, СоздатьНовую = Ложь)
	
	ПрочитатьСоздатьЗаписьРегистра(
			ИмяРегистра,
			"Комитент",
			Комитент,
			СоздатьНовую,
			КлючЗаписи,
			ПериодЗаписи); 
		
	Если ЗначениеЗаполнено(Запись.СтавкаНДС) Тогда
		СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СтавкаНДС, "ПеречислениеСтавкаНДС");
	Иначе
		СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЗаписьРегистраПриИзменииРеквизита(КлючЗаписи = Неопределено, ПериодЗаписи = Неопределено, СоздатьНовую = Ложь)
	
	Если НЕ Копирование Тогда
		ПрочитатьЗаписьРегистра(КлючЗаписи, ПериодЗаписи, СоздатьНовую);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПослеЗаписи()
	
	ПараметрыОповещения = Новый Структура("Контрагент, Период", Запись.Комитент, Запись.Период);
	ИмяСобытия = "Запись_" + ИмяРегистра;
	Оповестить(ИмяСобытия, ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьИзмененияНаСервере(Закрытие = Ложь) 
	
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда  
			Запись.ОсновноеНалогообложение = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
			Запись.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		Иначе 
			Запись.ОсновноеНалогообложение = Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН;
			Запись.СтавкаНДС = УчетНДСРФКлиентСерверПовтИсп.СтавкаНДСПоЗначениюПеречисления(СтавкаНДС, Перечисления.ТипыНалогообложенияНДС.ЛьготноеНалогообложениеНДСНаУСН);
		КонецЕсли;
	Иначе
		Запись.ОсновноеНалогообложение = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Запись.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка(); 
	КонецЕсли;
	ЗаписьУспешна = ЗаписатьИзменениеЗаписейРегистра(Закрытие);
	
	Возврат ЗаписьУспешна;
	
КонецФункции

&НаКлиенте
Функция ЗаписатьИзменения(Закрытие = Ложь)  
	
	ОчиститьСообщения();
	ЗаписьУспешна = ЗаписатьИзмененияНаСервере(Закрытие);
	Если ЗаписьУспешна Тогда
		ОповеститьПослеЗаписи();
	КонецЕсли;
	
	Возврат ЗаписьУспешна; 
	
КонецФункции

&НаКлиенте
Процедура ОткрытьИсториюИзменений()
	
	ОткрытьФорму("РегистрСведений.НастройкиУчетаНДСПриУСНКомитентов.Форма.РедактированиеИстории",
		Новый Структура("ТолькоПросмотр, Комитент", ТолькоПросмотр, Комитент),
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ОткрытьИсториюИзмененийЗавершение", ЭтотОбъект));
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюИзмененийПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ОткрытьИсториюИзменений();
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		Если НЕ ЗаписатьИзменения(Ложь) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюИзмененийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПрочитатьЗаписьРегистра(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСоздатьЗаписьРегистра(ИмяРегистра, ИмяИзмерения, Значение, СоздатьНовую, КлючЗаписи = Неопределено, ПериодЗначений = Неопределено, ДопРеквизиты = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(Значение) 
		И ЗначениеЗаполнено(КлючЗаписи) Тогда
		Значение = КлючЗаписи[ИмяИзмерения];
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздатьНовую Тогда
		КлючЗаписи = НастройкиНалоговУчетныхПолитик.НовыйКлючЗаписиУчетнойПолитики(ИмяРегистра, Значение, ПериодЗначений, ИмяИзмерения);
	КонецЕсли;
	
	Если КлючЗаписи = Неопределено Тогда
		
		ПериодКлюча = ПериодЗначений;
		Если ЗначениеЗаполнено(ДатаПредыдущая) Тогда
			ПериодКлюча = ДатаПредыдущая;
		КонецЕсли;
		КлючЗаписи = НастройкиНалоговУчетныхПолитик.КлючЗаписиДействующейУчетнойПолитики(ИмяРегистра, Значение, ПериодКлюча, ИмяИзмерения);
	ИначеЕсли ТипЗнч(КлючЗаписи) = Тип("Структура") Тогда
		КлючЗаписи = НастройкиНалоговУчетныхПолитик.НовыйКлючЗаписиУчетнойПолитики(ИмяРегистра, КлючЗаписи[ИмяИзмерения], КлючЗаписи.Период, ИмяИзмерения);
	КонецЕсли;
	
	МенеджерЗаписи = НастройкиНалоговУчетныхПолитик.МенеджерЗаписиПериодическогоРегистра(ИмяРегистра, КлючЗаписи, ИмяИзмерения, Запись);
	
	Если ДопРеквизиты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДопРеквизиты, МенеджерЗаписи);
	КонецЕсли;
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
	Если НЕ ЗначениеЗаполнено(ДатаИзменения) Тогда
		ДатаИзменения = МенеджерЗаписи.Период;
	КонецЕсли;
	
	НастройкиНалоговУчетныхПолитик.ОбновитьОписаниеИстории(ЭтотОбъект, ИмяРегистра, Значение, МенеджерЗаписи.Период, ИмяИзмерения);
	
	Попытка
		РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор); // Разблокируем другие ключи, заблокированные этой формой
		ЗаблокироватьДанныеДляРедактирования(КлючЗаписи,, УникальныйИдентификатор);
	Исключение
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заблокировать запись регистра по %1 - %2 за период %3.
					|%4'"),
			ИмяИзмерения,
			Значение,
			МенеджерЗаписи.Период,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

// Параметры:
// 	Закрытие - Булево - признак закрытия формы после записи.
// 	ДопРеквизиты - Структура - реквизиты регистра недоступные в данных формы.
// 	
// Возвращаемое значение:
// 	Булево - признак успешной записи
//
&НаСервере
Функция ЗаписатьИзменениеЗаписейРегистра(Закрытие = Ложь, ДопРеквизиты = Неопределено)
	
	Отказ = НЕ ПроверитьЗаполнение();
	Если Отказ Тогда
		Возврат НЕ Отказ;
	КонецЕсли;
	
	МенеджерЗаписи = РеквизитФормыВЗначение("Запись");
	МенеджерЗаписи.Период = ДатаИзменения;
	Если ДопРеквизиты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДопРеквизиты);
	КонецЕсли;
	МенеджерЗаписи.Записать(НЕ ЭтоФормаЗаписи);
	Модифицированность = Ложь;
	
	ДатаПредыдущая = МенеджерЗаписи.Период;
	
	Если НЕ Закрытие Тогда
		ПрочитатьСоздатьЗаписьРегистра(ИмяРегистра, "Комитент", Комитент, Ложь, Неопределено, МенеджерЗаписи.Период, ДопРеквизиты);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти
